grevaillot/svd_tools/headers/ATSAMD21E18A/memorymap.h
#pragma once 

#define PAC0_BASE			(0x40000000)
#define PM_BASE			(0x40000400)
#define SYSCTRL_BASE			(0x40000800)
#define GCLK_BASE			(0x40000c00)
#define WDT_BASE			(0x40001000)
#define RTC_BASE			(0x40001400)
#define EIC_BASE			(0x40001800)
#define PAC1_BASE			(0x41000000)
#define DSU_BASE			(0x41002000)
#define NVMCTRL_BASE			(0x41004000)
#define PORT_BASE			(0x41004400)
#define DMAC_BASE			(0x41004800)
#define USB_BASE			(0x41005000)
#define MTB_BASE			(0x41006000)
#define HMATRIX_BASE			(0x41007000)
#define PAC2_BASE			(0x42000000)
#define EVSYS_BASE			(0x42000400)
#define SERCOM0_BASE			(0x42000800)
#define SERCOM1_BASE			(0x42000c00)
#define SERCOM2_BASE			(0x42001000)
#define SERCOM3_BASE			(0x42001400)
#define TCC0_BASE			(0x42002000)
#define TCC1_BASE			(0x42002400)
#define TCC2_BASE			(0x42002800)
#define TC3_BASE			(0x42002c00)
#define TC4_BASE			(0x42003000)
#define TC5_BASE			(0x42003400)
#define ADC_BASE			(0x42004000)
#define AC_BASE			(0x42004400)
#define DAC_BASE			(0x42004800)
#define I2S_BASE			(0x42005000)
#define PORT_IOBUS_BASE			(0x60000000)
